In [28]:
%matplotlib inline
import pandas as pd
idx = pd.IndexSlice
WB = pd.read_json('C:/Users/askna/Desktop/Springboard/data_wrangling_json/data_wrangling_json/data/world_bank_projects.json')
import numpy as np

In [2]:
from IPython.core.display import HTML
css = open('C:/Users/askna/Desktop/Springboard/pycon-pandas-tutorial-master/style-table.css').read() + open('C:/Users/askna/Desktop/Springboard/pycon-pandas-tutorial-master/style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [3]:
WB.head(5)

,_id,approvalfy,board_approval_month,boardapprovaldate,borrower,closingdate,country_namecode,countrycode,countryname,countryshortname,...,sectorcode,source,status,supplementprojectflg,theme1,theme_namecode,themecode,totalamt,totalcommamt,url
0,{'$oid': '52b213b38594d8a2be17c780'},1999,November,2013-11-12T00:00:00Z,FEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA,2018-07-07T00:00:00Z,Federal Democratic Republic of Ethiopia!$!ET,ET,Federal Democratic Republic of Ethiopia,Ethiopia,...,"ET,BS,ES,EP",IBRD,Active,N,"{'Percent': 100, 'Name': 'Education for all'}","[{'code': '65', 'name': 'Education for all'}]",65,130000000,130000000,http://www.worldbank.org/projects/P129828/ethi...
1,{'$oid': '52b213b38594d8a2be17c781'},2015,November,2013-11-04T00:00:00Z,GOVERNMENT OF TUNISIA,NaN,Republic of Tunisia!$!TN,TN,Republic of Tunisia,Tunisia,...,"BZ,BS",IBRD,Active,N,"{'Percent': 30, 'Name': 'Other economic manage...","[{'code': '24', 'name': 'Other economic manage...","54,24",0,4700000,http://www.worldbank.org/projects/P144674?lang=en
2,{'$oid': '52b213b38594d8a2be17c782'},2014,November,2013-11-01T00:00:00Z,MINISTRY OF FINANCE AND ECONOMIC DEVEL,NaN,Tuvalu!$!TV,TV,Tuvalu,Tuvalu,...,TI,IBRD,Active,Y,"{'Percent': 46, 'Name': 'Regional integration'}","[{'code': '47', 'name': 'Regional integration'...","52,81,25,47",6060000,6060000,http://www.worldbank.org/projects/P145310?lang=en
3,{'$oid': '52b213b38594d8a2be17c783'},2014,October,2013-10-31T00:00:00Z,MIN. OF PLANNING AND INT'L COOPERATION,NaN,Republic of Yemen!$!RY,RY,Republic of Yemen,"Yemen, Republic of",...,JB,IBRD,Active,N,"{'Percent': 50, 'Name': 'Participation and civ...","[{'code': '57', 'name': 'Participation and civ...","59,57",0,1500000,http://www.worldbank.org/projects/P144665?lang=en
4,{'$oid': '52b213b38594d8a2be17c784'},2014,October,2013-10-31T00:00:00Z,MINISTRY OF FINANCE,2019-04-30T00:00:00Z,Kingdom of Lesotho!$!LS,LS,Kingdom of Lesotho,Lesotho,...,"FH,YW,YZ",IBRD,Active,N,"{'Percent': 30, 'Name': 'Export development an...","[{'code': '45', 'name': 'Export development an...","41,45",13100000,13100000,http://www.worldbank.org/projects/P144933/seco...

In [4]:
WB.columns

Index(['_id', 'approvalfy', 'board_approval_month', 'boardapprovaldate',
       'borrower', 'closingdate', 'country_namecode', 'countrycode',
       'countryname', 'countryshortname', 'docty', 'envassesmentcategorycode',
       'grantamt', 'ibrdcommamt', 'id', 'idacommamt', 'impagency',
       'lendinginstr', 'lendinginstrtype', 'lendprojectcost',
       'majorsector_percent', 'mjsector_namecode', 'mjtheme',
       'mjtheme_namecode', 'mjthemecode', 'prodline', 'prodlinetext',
       'productlinetype', 'project_abstract', 'project_name', 'projectdocs',
       'projectfinancialtype', 'projectstatusdisplay', 'regionname', 'sector',
       'sector1', 'sector2', 'sector3', 'sector4', 'sector_namecode',
       'sectorcode', 'source', 'status', 'supplementprojectflg', 'theme1',
       'theme_namecode', 'themecode', 'totalamt', 'totalcommamt', 'url'],
      dtype='object')

In [5]:
WB['countryname'].head()

0    Federal Democratic Republic of Ethiopia
1                        Republic of Tunisia
2                                     Tuvalu
3                          Republic of Yemen
4                         Kingdom of Lesotho
Name: countryname, dtype: object

In [6]:
projects=WB[['countryname','project_name']]

In [7]:
projects.head()

,countryname,project_name
0,Federal Democratic Republic of Ethiopia,Ethiopia General Education Quality Improvement...
1,Republic of Tunisia,TN: DTF Social Protection Reforms Support
2,Tuvalu,Tuvalu Aviation Investment Project - Additiona...
3,Republic of Yemen,Gov't and Civil Society Organization Partnership
4,Kingdom of Lesotho,Second Private Sector Competitiveness and Econ...

In [45]:
projects.countryname.value_counts().head()

Republic of Indonesia            19
People's Republic of China       19
Socialist Republic of Vietnam    17
Republic of India                16
Republic of Yemen                13
Name: countryname, dtype: int64

In [9]:
tp=projects.countryname.value_counts().to_frame().reset_index()

In [10]:
tp.columns=['country_name','project_count']

In [11]:
tp.project_count.unique()

array([19, 17, 16, 13, 12, 11,  9,  8,  7,  6,  5,  4,  3,  2,  1], dtype=int64)

In [164]:
# 10 Countries with most Projects

In [12]:
tp[tp.project_count >= 6]

                        country_name  project_count
0              Republic of Indonesia             19
1         People's Republic of China             19
2      Socialist Republic of Vietnam             17
3                  Republic of India             16
4                  Republic of Yemen             13
5                 Kingdom of Morocco             12
6    People's Republic of Bangladesh             12
7                              Nepal             12
8                             Africa             11
9             Republic of Mozambique             11
10      Islamic Republic of Pakistan              9
11                      Burkina Faso              9
12     Federative Republic of Brazil              9
13               Republic of Armenia              8
14            Republic of Tajikistan              8
15       United Republic of Tanzania              8
16                   Kyrgyz Republic              7
17  Lao People's Democratic Republic              7
18       Hashemite Kingdom of Jordan              7
19       Federal Republic of Nigeria              7
20             Republic of Nicaragua              6
21  Democratic Republic of the Congo              6
22                West Bank and Gaza              6
23                 Republic of Kenya              6
24      Islamic State of Afghanistan              6
25                  Republic of Peru              6

In [17]:
from pandas.io.json import json_normalize
import json

In [18]:
wb_string= json.load((open('C:/Users/askna/Desktop/Springboard/data_wrangling_json/data_wrangling_json/data/world_bank_projects.json')))

In [19]:
wb_sample=json_normalize(wb_string,'mjtheme_namecode')

In [30]:
wb_sample= wb_sample.replace(r'^\s*$',np.nan,regex = True)

In [31]:
wb_dropnas= wb_sample.dropna()

In [32]:
major_project_themes=wb_dropnas['name'].value_counts().head(11) #major project themes

In [33]:
major_project_themes

Environment and natural resources management    223
Rural development                               202
Human development                               197
Public sector governance                        184
Social protection and risk management           158
Financial and private sector development        130
Social dev/gender/inclusion                     119
Trade and integration                            72
Urban development                                47
Economic management                              33
Rule of law                                      12
Name: name, dtype: int64

In [34]:
null_table=wb_sample[wb_sample.name.isnull()] # extract null values from original dataset and make a dataframe consitinf of all missing name values
null_table.head()

   code name
1    11  NaN
13    6  NaN
17    8  NaN
19    7  NaN
24    2  NaN

In [35]:
len(null_table)

122

In [36]:
not_null=wb_sample[wb_sample.name.notnull()] # all the not null values seperated from null values
not_null.head()

  code                                   name
0    8                      Human development
2    1                    Economic management
3    6  Social protection and risk management
4    5                  Trade and integration
5    2               Public sector governance

In [37]:
original_file=not_null.drop_duplicates('code')# Create a lomissing values in lookup table to fill the missing name values in null table 
original_file

    code                                          name
0      8                             Human development
2      1                           Economic management
3      6         Social protection and risk management
4      5                         Trade and integration
5      2                      Public sector governance
6     11  Environment and natural resources management
8      7                   Social dev/gender/inclusion
11     4      Financial and private sector development
18    10                             Rural development
53     9                             Urban development
252    3                                   Rule of law

In [42]:
filled_missing_values = pd.merge(null_table,original_file,on ='code',how ='inner')
filled_missing_values.head(5)

  code name_x                                        name_y
0   11    NaN  Environment and natural resources management
1   11    NaN  Environment and natural resources management
2   11    NaN  Environment and natural resources management
3   11    NaN  Environment and natural resources management
4   11    NaN  Environment and natural resources management

In [48]:
filled_missing_values = filled_missing_values[['code','name_y']]
filled_missing_values.columns = ['Code','Missing Project Name']

In [49]:
filled_missing_values.head()

  Code                          Missing Project Name
0   11  Environment and natural resources management
1   11  Environment and natural resources management
2   11  Environment and natural resources management
3   11  Environment and natural resources management
4   11  Environment and natural resources management